Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКвартир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЖивут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетСпецКомунТранс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетТеплосеть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндОтопление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЖЕК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Другое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РезультатыПроверкиЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатКонтакта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завантажил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПотребителиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПотребителиУслуг</Name>
			<Comment>Физ.лица, внесенные в ЛС (жильцы)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерДляСубсидий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобДляСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛицевыеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ОпределитьОтветственногоВладельца(СтруктураДанные)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПрописанных, 0) КАК КоличествоПрописанных,
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)) КАК ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", СтруктураДанные.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец",	РезультатЗапроса.ОтветственныйВладелец);
		СтруктураДанные.Вставить("КоличествоПрописанных",	РезультатЗапроса.КоличествоПрописанных);
		СтруктураДанные.Вставить("КоличествоПроживающих",	РезультатЗапроса.КоличествоПроживающих);
		
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец",	Справочники.ПотребителиУслуг.ПустаяСсылка());
		СтруктураДанные.Вставить("КоличествоПрописанных",	0);
		СтруктураДанные.Вставить("КоличествоПроживающих",	0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НазначенныеУслуги.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеУслуги.Параметры.УстановитьЗначениеПараметра("Здание", Объект.Ссылка.Владелец);
	НазначенныеУслуги.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Ссылка.Владелец.Организация);
	НазначенныеУслуги.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	НазначенныеУслугиПодробно.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеУслугиПодробно.Параметры.УстановитьЗначениеПараметра("Здание", Объект.Ссылка.Владелец);
	НазначенныеУслугиПодробно.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Ссылка.Владелец.Организация);
	НазначенныеУслугиПодробно.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	НазначенныеСубсидии.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеСубсидии.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	НазначенныеЛьготы.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеЛьготы.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	УстановленныеПриборыУчета.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	
	ПаспортныйСтол.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	ПаспортныйСтол.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	НазначенныеМашиноМеста.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеМашиноМеста.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	НазначенныеДопРеквизиты.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеДопРеквизиты.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ТекущаяДата()));
	
	НазначенныеРегиональныеСубсидии.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	НазначенныеРегиональныеСубсидии.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
	ПлощадиЛицевогоСчета.Параметры.УстановитьЗначениеПараметра("Помещение", Объект.ОбъектЛицевогоСчета);
	ПлощадиЛицевогоСчета.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ТекущаяДата()));
	
	ПоказанияПриборовУчета.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	ПоказанияПриборовУчета.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ТекущаяДата()));
	
	ЛьготыЛицевогоСчета.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.Ссылка);
	ЛьготыЛицевогоСчета.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());

	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ЛицевойСчет", Объект.Ссылка);
		
		СтруктураДанные = ОпределитьОтветственногоВладельца(СтруктураДанные);
		
		ОтветственныйВладелец = СтруктураДанные.ОтветственныйВладелец;
		КоличествоПрописанных = СтруктураДанные.КоличествоПрописанных;
		КоличествоПроживающих = СтруктураДанные.КоличествоПроживающих;
		ПарольНадпись = СтруктураДанные.ОтветственныйВладелец.Пароль;
		
		//ЛогинДоступа = Прав(Объект.Ссылка.Владелец.Код, 2) + Формат(Объект.Ссылка.Код, "ЧГ=0; ЧЦ=4; ЧВН="); 
		ЛогинДоступа = СокрЛП(Объект.Наименование);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "СтраницаДополнительныеРеквизиты");
	// Конец СтандартныеПодсистемы.Свойства
	
	Элементы.НазначенныеДопРеквизиты.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРасширениеНачисленийЛицевыхСчетов");
	Локализация.ПриСозданииНаСервере(ЭтаФорма);

	ЗаполнитьРезультатыПроверки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОткрытьФорму("Обработка.ПомощникСозданияЛицевогоСчета.Форма.Форма", ,ЭтаФорма);
		Отказ = Истина;	
	Иначе
//{{MRG[ <-> ]
		Элементы.Здание.ТолькоПросмотр = Ложь;
//{{MRG[ <-> ]
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Элементы.Здание.ТолькоПросмотр = Истина;
//		Элементы.ОбъектЛицевогоСчета.ТолькоПросмотр = Истина;
//}}MRG[ <-> ]
		Элементы.ОбъектЛицевогоСчета.ТолькоПросмотр = Ложь;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Элементы.ОбъектЛицевогоСчета.ТолькоПросмотр = Истина;
//}}MRG[ <-> ]
	КонецЕсли;
	
	Если ЕстьАдминистративныеПрава() И ЗначениеЗаполнено(Объект.Ссылка) Тогда
//{{MRG[ <-> ]
		Элементы.ГруппаЛогинПароль.Видимость = Истина;	
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Элементы.ГруппаЛогинПароль.Видимость = Ложь;	
//}}MRG[ <-> ]
	Иначе
		Элементы.ГруппаЛогинПароль.Видимость = Ложь;	
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьАдминистративныеПрава()
	Возврат ПравоДоступа("АдминистрированиеДанных", Метаданные);	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеУслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "НазначенныеУслугиУслуга" или
		Поле.Имя = "НазначенныеУслугиЕдиницаИзмерения" или
		Поле.Имя = "НазначенныеУслугиПериод" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("Регистратор") Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "НазначенныеУслугиЗначениеТарифа" или
		Поле.Имя = "НазначенныеУслугиНормаПотребления" или
		Поле.Имя = "НазначенныеУслугиЗначениеТарифаПоНорме" или
		Поле.Имя = "НазначенныеУслугиПериодТарифа" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторТарифа") Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторТарифа);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененЛицевойСчет" Тогда
		ОтобразитьИзменениеДанных(Параметр, ВидИзмененияДанных.Изменение);	
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ЛицевойСчет", Объект.Ссылка);
			
			СтруктураДанные = ОпределитьОтветственногоВладельца(СтруктураДанные);
			
			ОтветственныйВладелец = СтруктураДанные.ОтветственныйВладелец;
			КоличествоПрописанных = СтруктураДанные.КоличествоПрописанных;
			КоличествоПроживающих = СтруктураДанные.КоличествоПроживающих;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеУслугиПодробноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные.Свойство("Регистратор") Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПаспортныйСтолВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "ПаспортныйСтолДатаВладелец" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторВладелец") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторВладелец) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторВладелец);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ПаспортныйСтолДатаНачалаДействия" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторПрописанных") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторПрописанных) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторПрописанных);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ПаспортныйСтолДатаОкончанияДействияПрописки" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторПрописанных") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторПрописанных) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторПрописанных);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ПаспортныйСтолПрописан" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторПрописанных") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторПрописанных) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторПрописанных);
		КонецЕсли;
		
		
	ИначеЕсли Поле.Имя = "ПаспортныйСтолПроживает" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторПроживающих") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторПроживающих) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторПроживающих);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ПаспортныйСтолДатаНачалаПроживания" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторПроживающих") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторПроживающих) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторПроживающих);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ПаспортныйСтолДатаОкончанияПериодаПроживания" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторПроживающих") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторПроживающих) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторПроживающих);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ПаспортныйСтолДоля" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторСобственников") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторСобственников) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторСобственников);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеСубсидииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные.Свойство("Регистратор") Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеЛьготыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные.Свойство("Регистратор") Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеПриборыУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "УстановленныеПриборыУчетаДатаОкончания" Тогда
		
		Если Элемент.ТекущиеДанные.Свойство("РегистраторОкончания") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РегистраторОкончания) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.РегистраторОкончания);
		КонецЕсли;
		
	Иначе
		
		Если Элемент.ТекущиеДанные.Свойство("Регистратор") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Регистратор) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Печать Карточку прописки
&НаКлиенте
Процедура ПечатьКарточкаПрописки(Команда)
	Жилец = Элементы.ПаспортныйСтол.ТекущиеДанные.ПотребительУслуг;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКарточкиПрописки", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

//Печать Справки прописанных
&НаКлиенте
Процедура ПечатьСправкиПрописанных(Команда)
	Жилец = Элементы.ПаспортныйСтол.ТекущиеДанные.ПотребительУслуг;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетСправкиПрописанных", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

//Печать Квитанции на оплату
&НаКлиенте
Процедура ПечатьКвитанцииНаОплату(Команда)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериодаОплаты");
	Форма.ЛицевойСчет = Объект.Ссылка;
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКвитанцииНаОплату", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСправкаОПрописке(Команда)
	Жилец = Элементы.ПаспортныйСтол.ТекущиеДанные.ПотребительУслуг;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "СправкаОПрописке", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКвитанцияНаОплатуУпрощенная(Команда)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериодаОплаты");
	Форма.ЛицевойСчет = Объект.Ссылка;
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКвитанцияНаОплатуУпрощенная", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетНаОплату(Команда)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериодаОплаты");
	Форма.ЛицевойСчет = Объект.Ссылка;
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "СчетНаОплату", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктОбОказанииУслуги(Команда)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериодаОплаты");
	Форма.ЛицевойСчет = Объект.Ссылка;
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "Акт", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСправкиОСоставеСемьи(Команда)
	Жилец = Элементы.ПаспортныйСтол.ТекущиеДанные.ПотребительУслуг;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "ПФ_MXL_СправкаОСоставеСемьиИПрописке", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
КонецПроцедуры


&НаКлиенте
Процедура СформироватьПарольДоступа(Команда)
	Объект.ПарольДоступа = ОСМДСервер.СгенерироватьИдентификатор();
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьEMail(Команда)
	
	АдресПисьма = Объект.ЭлПочта;
	ТемаПисьма = НСтр("ru='Параметры подключения к услуге ""ХВОЯ:Сайт ЖКХ""';uk='Параметри підключення до послуги ""ХВОЯ: Сайт ЖКГ""'");
	ТелоПисьма = НСтр("ru='
				|Адрес сайта: " + ПолучитьАдресСайтаХвояЖКХ(Объект.Владелец) + "
				|Логин: " + ЛогинДоступа + "
				|Пароль:  " + Объект.ПарольДоступа + "'");
	
	РаботаСПочтовымиСообщениямиКлиент.ОткрытьФормуОтправкиПочтовогоСообщения( ,АдресПисьма,ТемаПисьма,ТелоПисьма, ,Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресСайтаХвояЖКХ(Здание)
	
	ТаблицаНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
	Если НЕ ТипЗнч(ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
		Возврат "";
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаНастройки.НайтиСтроки(Новый Структура("Организация", Здание.Организация));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат НайденныеСтроки[0].АдресСайта;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказанияПриборовУчетаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ПоказанияПриборовУчета.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы <> Неопределено Тогда
		ПоказанияПриборовУчетаПриАктивизацииСтрокиНаСервере(ТекущиеДанныеТаблицы.ПриборУчета,ТекущиеДанныеТаблицы.Период);
	    Элементы.ТаблицаИсторииПоказаний.Обновить();
	Иначе
		ПоказанияПриборовУчетаПриАктивизацииСтрокиНаСервере(Неопределено,Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПоказанияПриборовУчетаПриАктивизацииСтрокиНаСервере(ПриборУчета,Период)
		
	ТаблицаИсторииПоказаний.Параметры.УстановитьЗначениеПараметра("ПриборУчета", ПриборУчета);
	ТаблицаИсторииПоказаний.Параметры.УстановитьЗначениеПараметра("ПериодН", Период);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
//{{MRG[ <-> ]
//{{MRG[ <-> ]
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	ВебИнтеграцияОбщегоНазначения.ДозаписатьОтветственногоВладельца(ОтветственныйВладелец, ТекущийОбъект.Ссылка);
//}}MRG[ <-> ]
	//ВебИнтеграцияОбщегоНазначения.ДозаписатьОтветственногоВладельца(ОтветственныйВладелец, ТекущийОбъект.Ссылка);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	ВебИнтеграцияОбщегоНазначения.ДозаписатьОтветственногоВладельца(ОтветственныйВладелец, ТекущийОбъект.Ссылка);
//}}MRG[ <-> ]
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСправкаОПлатежах(Команда)
	Жилец = Элементы.ПаспортныйСтол.ТекущиеДанные.ПотребительУслуг;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
	
	МассивСсылкаЛицевогоСчета = Новый Массив;
	МассивСсылкаЛицевогоСчета.Добавить(Объект.Ссылка);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "ПФ_MXL_СправкаОРазмереПлатежей", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРезультатыПроверки()
	РезультатыПроверки.Очистить();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РП.Период КАК ДатаЗняття,
	|	РП.Фото КАК Фото,
	|	РП.РезультатКонтакта КАК РезультатКонтакта,
	|	РП.Геолокация КАК Геолокация,
	|	РП.Завантажил КАК Завантажил
	|ИЗ
	|	РегистрСведений.РезультатыПроверкиЛицевыхСчетов КАК РП
	|ГДЕ
	|	РП.ЛицевойСчет = &ЛС
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗняття УБЫВ";
	Запрос.УстановитьПараметр("ЛС", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультатыПроверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРезультатыПроверки(Команда)
	ЗаполнитьРезультатыПроверки();
КонецПроцедуры

&НаКлиенте
Процедура ПереглянутиФото(Команда)
	ТекущиеДанные = Элементы.РезультатыПроверки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Предупреждение(НСтр("ru='Выберите строку.';uk='Виберіть рядок.'"));
		Возврат;
	КонецЕсли;
	Адрес = АдресФотоНаСервере(ТекущиеДанные.ДатаЗняття);
	Если ПустаяСтрока(Адрес) Тогда
		Предупреждение(НСтр("ru='Изображение отсутствует.';uk='Зображення відсутнє.'"));
		Возврат;
	КонецЕсли;
	ИмяФайла = ?(ПустаяСтрока(ТекущиеДанные.Фото), "photo.jpg", ТекущиеДанные.Фото);
	ПолучитьФайл(Адрес, ИмяФайла, Истина);
КонецПроцедуры

&НаСервере
Функция АдресФотоНаСервере(ДатаЗняття)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РП.Изображение КАК Изображение
	|ИЗ
	|	РегистрСведений.РезультатыПроверкиЛицевыхСчетов КАК РП
	|ГДЕ
	|	РП.ЛицевойСчет = &ЛС
	|	И РП.Период = &П";
	Запрос.УстановитьПараметр("ЛС", Объект.Ссылка);
	Запрос.УстановитьПараметр("П", ДатаЗняття);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Хранилище = Выборка.Изображение;
		Если ТипЗнч(Хранилище) = Тип("ХранилищеЗначения") Тогда
			ДвоичныеДанные = Хранилище.Получить();
			Если ДвоичныеДанные <> Неопределено Тогда
				Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции
